import random

def загадати_число():
    """Генерує випадкове число від 1 до 100."""
    return random.randint(1, 100)

def перевірка_числа(введене_число, загадане_число):
    """Перевіряє введене число та повертає результат."""
    if введене_число < загадане_число:
        return "Загадане число більше."
    elif введене_число > загадане_число:
        return "Загадане число менше."
    else:
        return f"Вітаємо! Ви вгадали число {загадане_число}."

def гра():
    загадане_число = загадати_число()
    спроби = 0

    while True:
        спроби += 1
        введене_число = input("Спробуйте вгадати число від 1 до 100: ")

        try:
            введене_число = int(введене_число)
        except ValueError:
            print("Введіть дійсне число!")
            continue

        результат = перевірка_числа(введене_число, загадане_число)
        print(результат)

        if результат.startswith("Вітаємо!"):
            break
